let total = {
  "Балашов\nГеннадій": 0,
  "Безсмертний\nРоман": 0,
  "Богомолець\nОльга": 0,
  "Богословська\nІнна": 0,
  "Бойко\nЮрій": 0,
  "Бондар\nВіктор": 0,
  "Ващенко\nОлександр": 0,
  "Вілкул\nОлександр": 0,
  "Габер\nМикола": 0,
  "Гриценко\nАнатолій": 0,
  "Данилюк\nОлександр": 0,
  "Дерев’янко\nЮрій": 0,
  "Журавльов\nВасиль": 0,
  "Зеленський\nВолодимир": 0,
  "Каплін\nСергій": 0,
  "Кармазін\nЮрій": 0,
  "Кива\nІлля": 0,
  "Корнацький\nАркадій": 0,
  "Кошулинський\nРуслан": 0,
  "Кривенко\nВіктор": 0,
  "Купрій\nВіталій": 0,
  "Литвиненко\nЮлія": 0,
  "Ляшко\nОлег": 0,
  "Мороз\nОлександр": 0,
  "Наливайченко\nВалентин": 0,
  "Насіров\nРоман": 0,
  "Новак\nАндрій": 0,
  "Носенко\nСергій": 0,
  "Петров\nВолодимир": 0,
  "Порошенко\nПетро": 0,
  "Ригованов\nРуслан": 0,
  "Скоцик\nВіталій": 0,
  "Смешко\nІгор": 0,
  "Соловйов\nОлександр": 0,
  "Тарута\nСергій": 0,
  "Тимошенко\nЮлія": 0,
  "Тимошенко\nЮрій": 0,
  "Шевченко\nІгор": 0,
  "Шевченко\nОлександр": 0,
  "10.К-сть бюлетенів, визнаних недійсними": 0
};
let names = Object.keys(total);

Object.keys(elections2019).forEach(id => {
  elections2019[id].data.forEach(o => names.forEach(name => total[name] += parseInt(o[name])));
});

let results = Object.keys(total).map(name => {
  return {name: name, value: total[name]};
});
results.sort((a, b) => a.value < b.value ? 1 : (a.value > b.value ? -1 : 0));
results.forEach(o => o.name = o.name.replace("\n", " "));

let table = document.getElementById("results");
results.forEach(o => table.innerHTML += `<tr><td>${o.name}</td><td>${o.value}</td></tr>\n`);
//console.debug(results);